package step.learning.oop;

public class OopDemo {
    public void run(){
        Book book=new Book("D. Kunth", "Art of programming");
        System.out.println(book.getCard());
        Library library = new Library();
        library.add(book);
        library.printAllCards();
    }
}
/*
Бібліотека
Моделюємо книгосховище (бібліотеку) у якому є каталог
Видання є різного типу: книги, газети, журнали, тощо
Кожен тип має однакову картку у каталозі, у якій відзначається тип видання

Абстрагування - створення абстракцій, проєктування, :
 Література - термін, щ поєднує реальні сутності (книги, газети, журнали, тощо)
 Оскільки довільне видання повинно формувати картку, для каталога, у цей клас
 (Література) має бути виключений метод getCard(), але, оскільки до нього входить
 відомість про тип (який відомий тільки у конкретному об'єкті), цей метод може
 бути тільки абстрактний.
 */
/*
ООП - об'єктно-орієнтована парадигма програмування
Програма - управління об'єктами та їх взаємодією
Програмування - налаштування об'єктів та зв'язків
Види зв'язків:
 - спадкування (наслідування)
 - асоціація
 - композиція
 - агрегація
 - залежність
* */

